---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeClassParam
source: html/b5b8661e-5ee3-2abe-bba7-7aaa484cd8b9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeClassParam Property

"Schedule/Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeClassParam { get; }
```